In [1]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/05/4b/cade88002bce6a808c44199617160bd9d78c23d4bb91950f4397aebf063f/pandas-1.5.0-cp38-cp38-macosx_10_9_x86_64.whl (11.9MB)
    100% |████████████████████████████████| 11.9MB 4.6MB/s eta 0:00:01
Collecting pytz>=2020.1 (from pandas)
  Using cached https://files.pythonhosted.org/packages/d5/50/54451e88e3da4616286029a3a17fc377de817f66a0f50e1faaee90161724/pytz-2022.2.1-py2.py3-none-any.whl
Requirement already satisfied: numpy>=1.20.3; python_version < "3.10" in ./venv/lib/python3.8/site-packages (from pandas) (1.23.3)
Requirement already satisfied: python-dateutil>=2.8.1 in ./venv/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.5.0 pytz-2022.2.1

In [17]:
import pandas as pd

In [18]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [19]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [20]:
df.loc[0] = ["Allen", "22", "175"]

In [21]:
df

    Name Age Height
0  Allen  22    175

In [22]:
df.loc[1] = ["Ted", "25", "180"]
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [23]:
df["Height"]

0    175
1    180
Name: Height, dtype: object

In [24]:
df["Weight"] = [75, 80]

In [25]:
df

    Name Age Height  Weight
0  Allen  22    175      75
1    Ted  25    180      80

In [26]:
df["Weight"]

0    75
1    80
Name: Weight, dtype: int64

In [30]:
df

    Name Age Height  Weight
0  Allen  22    175      75
1    Ted  25    180      80

In [31]:
df.drop(["Weight"], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [32]:
df

    Name Age Height  Weight
0  Allen  22    175      75
1    Ted  25    180      80

In [33]:
df = df.drop(["Weight"], axis=1)

In [34]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [35]:
df.drop(1)

    Name Age Height
0  Allen  22    175

In [36]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [37]:
df["Height"][1]

'180'

In [38]:
df["Height"][1] = '185'

In [40]:
columns = ["Name", "Age", "height"]
data = [
    ["Allen", "22", "175"],
    ["Ted", "25", "180"]
]
df2 = pd.DataFrame(data=data, columns=columns)
df2

    Name Age height
0  Allen  22    175
1    Ted  25    180

In [41]:
df.append(df2)

/var/folders/bv/8bbkzq895db366kq27vw262r0000gn/T/ipykernel_17442/2094904254.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2)

    Name Age Height height
0  Allen  22    175    NaN
1    Ted  25    185    NaN
0  Allen  22    NaN    175
1    Ted  25    NaN    180

In [42]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    185

In [43]:
df = df.append(df2)
df

/var/folders/bv/8bbkzq895db366kq27vw262r0000gn/T/ipykernel_17442/1571675516.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2)

    Name Age Height height
0  Allen  22    175    NaN
1    Ted  25    185    NaN
0  Allen  22    NaN    175
1    Ted  25    NaN    180

In [44]:
df.reset_index()

   index   Name Age Height height
0      0  Allen  22    175    NaN
1      1    Ted  25    185    NaN
2      0  Allen  22    NaN    175
3      1    Ted  25    NaN    180

In [45]:
df

    Name Age Height height
0  Allen  22    175    NaN
1    Ted  25    185    NaN
0  Allen  22    NaN    175
1    Ted  25    NaN    180

In [46]:
df = df.reset_index(drop=True)

In [47]:
df

    Name Age Height height
0  Allen  22    175    NaN
1    Ted  25    185    NaN
2  Allen  22    NaN    175
3    Ted  25    NaN    180

In [48]:
df["Age"]

0    22
1    25
2    22
3    25
Name: Age, dtype: object

In [49]:
df.loc[2]

Name      Allen
Age          22
Height      NaN
height      175
Name: 2, dtype: object